## Ввод данных
  
year =int(input("Введите год: "))


## Проверка граничного случая (год должен быть логичным)

if year <= 0:
    print("год введен неккоректно")
    
else:
## Алгоритм определения високосного года:
# Год високосный, если он делится на 4, но не делится на 100, либо если он делится на 400.

    if (year % 4 == 0 and year % 100 != 0) or (year % 400 == 0):
        is_leap = True
        days = 366
        status = "високосный"
    else:
        is_leap = False
        days = 365
        status = "не високосный"

## Вывод результатов в читаемом виде 

    print("\nРезультаты расчетов:")
    print(f"Год {year} — {status}.")
    print(f"Количество дней в этом году: {days}")