## вывод первых n чисел Фибоначчи
print("ВЫВОД РЯДА ФИБОНАЧЧИ")

n = int(input("Сколько первых чисел Фибоначчи вывести? (n): "))

# обработка ошибки
if n <= 0:
    print("Ошибка: количество чисел должно быть больше 0.")
else:
    a, b = 0, 1
    print(f"Первые {n} чисел Фибоначчи:")
    for i in range(n):
        print(a, end=" ")
        a, b = b, a + b
    print()


## чтоб красиво было 
print("\n" + "="*40 + "\n")


## проверка принадлежности числа к ряду
print("ПРОВЕРКА НА ПРИНАДЛЕЖНОСТЬ К РЯДУ")

#ввод числа
check_num = int(input("Введите число для проверки: "))

# если число отрицательное, пропускаем основной расчет
if check_num < 0:
    print(f"Число {check_num} НЕ принадлежит ряду Фибоначчи (оно отрицательное).")
else:
    f1, f2 = 0, 1
    is_found = False
    
## Запускаем бесконечный цикл, управление которым передаем операторам
    while True:
# если число f1 четное, мы все равно идем дальше 
        if f1 % 2 == 0:
            pass # пропуск действия
            
        if f1 == check_num:
            is_found = True
            break  # нашли число
            
        if f1 > check_num:
            break  # перешагнули число, дальше искать нет смысла
            
        f1, f2 = f2, f1 + f2
    
## Корректный вывод на основе флага из цикла
    if is_found:
        print(f"число {check_num} принадлежит ряду Фибоначчи")
    else:
        print(f"число {check_num} НЕ принадлежит ряду Фибоначчи")